#include <stdio.h>

int main()
{
    system("chcp 65001 > null"); // 设置控制台输出编码为UTF-8
    printf("切换至UTF-8编码,避免中文乱码\nHello World!你好\n");
    printf("\033[31m这是红色文字\033[0m\n");
    printf("\033[32m这是绿色文字\033[0m\n");
    printf("\033[33m这是黄色文字\033[0m\n");
    printf("\033[34m这是蓝色文字\033[0m\n");
    printf("\033[35m这是紫色文字\033[0m\n");
    printf("\033[36m这是青色文字\033[0m\n");
    // 组合使用：绿色背景(42)，白色文字(37)
    printf("\033[42;37m 绿底白字 \033[0m\n");
    // 高亮/加粗 (代码 1)
    printf("\033[1;31m这是加粗的红色文字\033[0m\n");
    // 下划线 (代码 4)
    printf("\033[4;32m这是带有下划线的绿色文字\033[0m\n");
    // 反显 (代码 7)
    printf("\033[7;33m这是反显的黄色文字\033[0m\n");
    
    char a=256+65;//char也是整型，本质是数字，范围0~255，使用%c可以显示对应的ASCII字符
    printf("%c,%c,%c\n",a,321,65);
    return 0;
}